console.log("Hello world");

// Створіть змінну з ім'ям name і присвойте їй ваше ім'я. Виведіть це ім'я в консоль.

const name = "Oleksiy";
console.log(name);

// Створіть змінну age і присвойте їй ваш вік. Виведіть в консоль рядок, що містить ваш вік у такому форматі:
// "Мені {вік} років".

const age = 33;
console.log(`Мені ${age} років`);

// Створіть змінні x і y і присвойте їм довільні числа. Виведіть в консоль результати додавання, віднімання,
// множення та ділення цих чисел.

const x = 10;
const y = 2;
console.log(x + y, x - y, x * y, x / y);

// Створіть змінну city і присвойте їй назву вашого міста. Створіть рядок, який містить "Я живу в місті
// {назва міста } ", і виведіть його в консоль.

const city = "Dnipro";
console.log(`Я живу в місті ${city}`);

// Створіть рядок з вашою електронною поштою. Використайте методи рядка, щоб витягнути ваше ім'я та доменну
// частину.Виведіть обидва ці значення в консоль.

const mail = "Alekseyko-2208@gmail.com";
console.log(mail.slice(0, 14));
console.log(mail.slice(15, mail.length));

// Створіть змінну price і присвойте їй число. Створіть рядок, що містить ціну з символом гривні, наприклад:
// "Ціна: 500 грн".

const price = 500;
console.log(`Ціна: ${price} грн`);

// Створіть змінну isLogged, яка має булеве значення. Виведіть в консоль повідомлення
// "Користувач авторизований", якщо isLogged дорівнює true, і "Користувач неавторизований", якщо isLogged
// дорівнює false.

const isLogged = false;
if (isLogged === true) {
  console.log("Користувач авторизований");
} else {
  console.log("Користувач неавторизований");
}
