console.log("Hello world");

//! Делегування подій

//! Поширення подій

// Поширення подій (event propagation) — це термін, що описує життєвий цикл події, який має три етапи:
// Занурення (capture phase).
// Таргетинг (target phase).
// Спливання (bubble phase).

// На практиці найчастіше використовують тільки фазу спливання.

// Давайте розглянемо детальніше ці фази під час настання події.

// Capturing phase(занурення) — подія починається на window і тоне(проходить через усі елементи - предки) до найглибшого
// цільового елемента, на якому відбулася подія.На схемі подія — це клік, і capturing закінчується на елементі < button >.

// Target phase(таргетинг) — подія дійшла до цільового елемента.Цей етап містить тільки повідомлення елемента про те, що
// на ньому відбулася дія.

// Bubbling phase(спливання) — кінцева фаза, подія спливає від найглибшого, цільового елемента, через усі елементи - предки
// до window.

// Поширення подій часто неправильно використовується як синонім стадії спливання, але це лише частина всього процесу.Тому
// щоразу, коли відбувається подія, відбувається її поширення.

//! Спливання подій
// Зараз ми зосередимося на фазі спливанні події, адже часто розробник працює саме зі спливанням.

// Під час настання події обробники спочатку спрацьовують на найбільш вкладеному елементі.Потім — на його батьківському
// елементі, потім — вище і так далі, вгору по ланцюжку вкладеності.Цей процес називається спливання(event bubbling), тому
// що події «спливають» від внутрішнього елемента вгору через усіх предків до window, подібно до спливання бульбашки повітря
// у воді.

// Розглянемо приклад: є три вкладені теги <div> з обробниками кліка на кожному з них.
{
  /* <div id="parent">
  Parent
  <div id="child">
    Child
    <div id="descendant">Descendant</div>
  </div>
</div>; */
}
// Спливання гарантує, що клік по #descendant викличе обробник кліка в такому порядку:
// спочатку на самому #descendant,
// потім на елементі #child,
// далі на елементі #parent,
// і так далі, вгору по ланцюжку предків до window.

// Отже, якщо в прикладі клікнути на #descendant, то послідовно виведуться сповіщення через console.log для
// descendant → child → parent.

// Вивчи, як це відбувається в живому прикладі.

// const parent = document.querySelector("#parent");
// const child = document.querySelector("#child");
// const descendant = document.querySelector("#descendant");

// parent.addEventListener("click", () => {
//   console.log("Parent click handler");
// });
// child.addEventListener("click", () => {
//   console.log("Child click handler");
// });
// descendant.addEventListener("click", () => {
//   console.log("Descendant click handler");
// });

//! Цільовий елемент
// Незалежно від місця, де ми спіймали слухачем подію під час її спливання, завжди можна дізнатися, де саме вона відбулася.
// Елемент, на якому відбулася подія, називається цільовим, або вихідним.Це завжди найглибший елемент, з якого починається
// спливання.Він доступний як event.target.

// event.target — це посилання на вихідний елемент, на якому відбулася подія, у процесі спливання вона — незмінна.
// event.currentTarget — це посилання на поточний елемент, до якого прив’язаний поточний обробник події, і до якого в
// результаті спливання дійшла прослуховувана подія.

// Якщо слухач події зареєстрований на найвищому елементі, то цей обробник зможе "перехопити" всі кліки, які відбуваються на
// його дочірніх елементах, завдяки механізму спливання подій.У прикладі нижче це працює таким чином: обробник зареєстрований
// на елементі "Parent".Кліки на "Descendant" або "Child" будуть спливати до "Parent", де їх і буде оброблено цим обробником.
// Тому важливо розуміти різницю між елементом, де подія фактично відбулася(event.target), та елементом, до якого подія спливла,
// і обробник її перехопив(event.currentTarget).

// Відкрий консоль у прикладі і поклікай. Зверни увагу, що:

// event.target — це завжди вихідний (і найглибший) елемент, на якому був клік;
// event.currentTarget при цьому не змінюється.

// const parent = document.querySelector("#parent");

// parent.addEventListener("click", (event) => {
//   console.log("event.target: ", event.target);
//   console.log("event.currentTarget: ", event.currentTarget);
// });

//! Припинення спливання
// Зазвичай подія буде спливати вгору до елемента window, викликаючи всі наявні обробники на своєму шляху.
// А інколи один елемент може мати кілька обробників на одну й ту саму подію.

// Уявімо, що сталася подія на елементі Descendant. Подія спливає до Child і Parent.
// Будь-який проміжний обробник може зупинити спливання цієї події за допомогою методів об’єкта події (event):

// event.stopPropagation(),
// event.stopImmediatePropagation(),

// У чому ж різниця у використанні цих методів?

// event.stopPropagation()

// Зупиняє "спливання" події в DOM-дереві. Це означає, що жоден батьківський елемент не зможе відловити цю подію.
// Не заважає іншим обробникам подій виконуватися на тому ж самому елементі.

// event.stopImmediatePropagation()

// Зупиняє "спливання" події так само, як event.stopPropagation().
// Також зупиняє виконання всіх інших обробників подій, які слухають цю ж подію на даному елементі, навіть якщо вони
// були зареєстровані перед цим.

// const parent = document.querySelector("#parent");
// const child = document.querySelector("#child");
// const descendant = document.querySelector("#descendant");

// parent.addEventListener("click", () => {
//   alert(
//     "Parent click handler. This alert will not appear when clicking on Descendant, the event will not reach here!"
//   );
// });

// child.addEventListener("click", () => {
//   alert(
//     "Child click handler. This alert will not appear when clicking on Descendant, the event will not reach here!"
//   );
// });

// descendant.addEventListener("click", (event) => {
//   event.stopPropagation();
//   alert("Descendant click handler");
// });

// !Не припиняйте спливання без необхідності.
//  Припинення спливання створює свої підводні камені, які потім доводиться обходити.Наприклад, вебаналітика використовує
// спливання, щоб відстежувати дії користувача на сторінці, тому якщо зупинити спливання подій, то це унеможливить збір
// цієї інформації.

//! Делегування подій
// Спливання дозволяє реалізувати один із найкорисніших прийомів — делегування подій.
// Уявімо, що є група елементів.Їх події потрібно обробляти однаково.Для цього треба додати обробник до кожного елемента.
// Але це не зручно.
// Делегування подій (event delegation) полягає в додаванні одного обробника на спільного предка цих елементів.
// Розглянемо делегування на прикладі:
// створюємо елемент <div>,
// додаємо до нього будь-яку кількість кнопок, наприклад, 100,
// реєструємо на кожній кнопці слухача події кліку з обробником handleButtonClick.

// Проблема в тому, що в нас є 100 слухачів подій. Усі вони вказують на один і той самий обробник слухача, але слухачів 100.
// Завдяки тому, що події спливають, ми можемо відловити їх на спільному предку — елементі <div>.

// Тепер є тільки один слухач події кліку з обробником handleButtonClick і браузеру не потрібно зберігати в пам'яті
// 100 різних слухачів.

// !Отже, делегування реалізується у три прості кроки.
// 1. Визначити спільного предка групи елементів для відстеження подій.
// 2. Зареєструвати на елементі-предку обробник події, яку ми хочемо відловлювати з групи елементів.
// 3. В обробнику використовувати event.target для вибору цільового елемента, на якому безпосередньо відбулась подія.

// У коді це матиме такий вигляд:

// const box = document.querySelector(".box");

// box.addEventListener("click", function (event) {
//   console.log(event.target); // Елемент, на якому відбулась подія click
// });

// Такий підхід спрощує ініціалізацію слухачів однотипних елементів.Можна додавати, видаляти або змінювати елементи.
// При цьому не потрібно вручну додавати або видаляти обробники подій на кожному з них.
// Розбери код живого прикладу, в якому цільовий елемент кліка виводиться в консоль.

// Спробуй клікнути по кнопках, а також безпосередньо між ними, по div.box, і подивись результат.

// const box = document.querySelector(".box");

// box.addEventListener("click", (e) => {
//   console.log(e.target);
// });

//! Перевірка цільового елемента події
// Є задача створити палітру кольорів. Палітра дає можливість вибрати колір по кліку і відображає обраний колір.

{
  /* <p class="output">Selected color: -</p>
<div class="color-palette"></div> */
}

// Кожен клік на елементі палітри — це подія, яка змінює колір і вміст заголовка.Елементів дуже багато.Замість
// призначення обробника кожному елементу палітри, повісимо один слухач на загального предка div.color - palette.

// const colorPalette = document.querySelector(".color-palette");

// colorPalette.addEventListener("click", selectColor);

// function selectColor(event) {
//   console.log(event.target);
//   const selectedColor = event.target.dataset.color;
// }

// В обробнику події кліка використовуємо event.target, щоб отримати елемент, на якому безпосередньо відбулася подія,
// і пов'язаний з ним колір. Інформацію про колір будемо зберігати в атрибуті data-color.
// Обов'язково перевіряємо цільовий елемент події click.

// Це точно має бути кнопка, в іншому разі ми випадково можемо обробити клік, коли користувач клікне між кнопками, що
// може викликати помилку.

// Для перевірки типу елемента використовуємо властивість nodeName.
// function selectColor(event) {
//   if (event.target.nodeName !== "BUTTON") {
//     return; // користувач клікнув між кнопками
//   }

//   const selectedColor = event.target.dataset.color; // користувач клікнув на кнопку і ми маємо доступ до її атрибутів
// }
// Розглянь повний живий приклад створення палітри кольорів.

// const colorPalette = document.querySelector(".color-palette");
// const output = document.querySelector(".output");

// colorPalette.addEventListener("click", selectColor);

// // This is where delegation «magic» happens
// function selectColor(event) {
//   if (event.target.nodeName !== "BUTTON") {
//     return;
//   }

//   const selectedColor = event.target.dataset.color;
//   output.textContent = `Selected color: ${selectedColor}`;
//   output.style.color = selectedColor;
// }

// Some helper functions to render palette items
// createPaletteItems();

// function createPaletteItems() {
//   const items = [];
//   for (let i = 0; i < 60; i++) {
//     const color = getRandomHexColor();
//     const item = document.createElement("button");
//     item.type = "button";
//     item.dataset.color = color;
//     item.style.backgroundColor = color;
//     item.classList.add("item");
//     items.push(item);
//   }
//   colorPalette.append(...items);
// }

// function getRandomHexColor() {
//   const letters = "0123456789ABCDEF";
//   let color = "#";

//   for (let i = 0; i < 6; i++) {
//     color += letters[Math.floor(Math.random() * 16)];
//   }

//   return color;
// }

//! Бібліотеки;
// Бібліотеки — це набір попередньо написаних функцій, методів і класів, який надає розробнику готові інструменти для
// вирішення певних завдань.Бібліотеки створюються для полегшення розробки, оскільки дають змогу використовувати готові
// рішення, необхідні для низки завдань, без потреби писати код з нуля.
// Основні характеристики бібліотек:

// Багаторазове використання: Бібліотеки створюються з метою повторного використання.Розробники можуть інтегрувати
// бібліотеки в різні проєкти й використовувати їхній функціонал без необхідності писати код з нуля.
// Перевизначений функціонал: Бібліотеки містять готовий код, який можна використовувати для розв'язання поширених завдань.
// Наприклад, бібліотеки можуть містити функції для роботи з датами, опрацювання рядків, виконання анімацій і багато чого
// іншого.
// Прискорення розробки: Використання бібліотек дає змогу скоротити час розробки, оскільки розробнику не потрібно створювати
// й налагоджувати функції або компоненти з нуля.Вони можуть застосовувати готові та перевірені рішення.
// Суспільство та підтримка: Хороші бібліотеки часто підтримуються активною спільнотою розробників, які вносять покращення,
// виправлення помилок і забезпечують зворотну сумісність.

// Приклади популярних бібліотек у JavaScript:

// Chart.js: Бібліотека для створення інтерактивних графіків і діаграм.
// Lodash: Бібліотека для роботи з масивами, об'єктами, рядками тощо, що надає безліч зручних функцій.

// Важливо обирати бібліотеки, які найкраще підходять для вашого проєкту, і стежити за їхніми оновленнями, щоб
// використовувати останні покращення та виправлення помилок.

//! CDN;
// CDN(Content Delivery Network) — це географічно розподілена мережева інфраструктура.Вона забезпечує швидку доставку
// контенту(такого як стилі, скрипти, зображення та інші ресурси) користувачам вебсервісів і сайтів.Сервери, що входять
// до складу CDN, географічно розташовуються в різних частинах світу таким чином, щоб зробити час відповіді для користувачів
// сайту / сервісу мінімальним.

// !Основна мета CDN — поліпшити продуктивність і доступність вебсайту для користувачів, зменшивши затримки під час
// !завантаження контенту.

// Це досягається шляхом зберігання копій контенту на серверах CDN, які фізично ближче до користувачів.Під час запиту
// контенту браузер користувача автоматично звертається до найближчого сервера CDN, що прискорює завантаження

// Переваги використання CDN:

// Швидке завантаження контенту: Контент завантажується із сервера, фізично близького до користувача, що скорочує час
// завантаження.
// Розподілене навантаження: Сервери CDN розподілені по всьому світу, що дає змогу більш рівномірно розподіляти навантаження
// і знижує ризик перевантажень.
// Покращена доступність: Якщо один сервер не доступний, браузер користувача може звернутися до іншого сервера CDN, гарантуючи
// доступність контенту.
// Зниження навантаження на вихідний сервер: Копії контенту зберігаються на серверах CDN, що знижує навантаження на вихідний
// сервер, особливо в разі високої відвідуваності.

//! Підключення бібліотеки
// Для того щоб мати можливість використовувати бібліотеку в проєкті, її необхідно підключити, тобто додати файли бібліотеки
// до проєкту.

// Для прикладу підключимо до проєкту бібліотеку Lodash через CDN.Підключення JavaScript бібліотеки через CDN складається
// з декількох кроків.

// Крок 1. Для початку зайди на сайт CDN сервісу https://www.jsdelivr.com/ і знайди необхідну бібліотеку за її ім'ям.

// Крок 2. У списку результатів обери необхідну бібліотеку, клікнувши на назву.Після переходу за посиланням, ти опинишся
// на сторінці з інформацією про бібліотеку.

// Крок 3. Скопіюй HTML - код тега script, після чого відкрий свій HTML - файл і додай посилання на скрипт бібліотеки наприкінці
// HTML - документа, як показано в прикладі.

// <!DOCTYPE html>
// <html lang="en">
//   <head>
// 	 <!-- head tags -->
//   </head>
//   <body>
//     <!-- HTML-markup -->

//     <!-- Lodash library script file -->
// 		<script async src="https://cdn.jsdelivr.net/npm/lodash@4.17.21/lodash.min.js"></script>
//     <!-- Your script file -->
//     <script defer src="path/to/script.js"></script>
//   </body>
// </html>

// Підключення скрипта бібліотеки має бути до підключення твого основного файлу скриптів.
// Не забудь додати тегу script бібліотеки атрибут async.Це потрібно для того, щоб файл бібліотеки завантажувався
// якомога швидше.

// Тепер ти можеш отримати доступ до бібліотеки у своєму скрипті.

// При підключенні бібліотек через CDN, до об'єкта window додається властивість, у якій зберігається те, що надає бібліотека.
// Ім'я цієї властивості унікальне для бібліотеки та описане в її документації.

// Для Lodash — це символ нижнього підкреслення _.

// console.log(_); // Весь об'єкт бібліотеки Lodash

// Для перевірки використовуй методи:

// sum — він обчислює суму значень у масиві
// shuffle — створює масив перетасованих значень

// console.log(_.sum([4, 2, 8, 6])); // 20
// console.log(_.sum([5, 10])); // 15

// console.log(_.shuffle([1, 2, 3, 4])); // [4, 1, 3, 2]
// console.log(_.shuffle([1, 2, 3, 4])); // [3, 2, 1, 4]

// !Зверни увагу! Спосіб підключення та використання бібліотек може відрізнятися залежно від конкретної бібліотеки.

// Усі сучасні бібліотеки надають документацію та приклади використання на своїх офіційних вебсайтах, що може допомогти
// глибше розібратися в їхньому функціоналі.

//! Як читати документацію бібліотеки
// Уявімо, що ти розробник, який створює сайт пошуку зображень.Тобі потрібно, щоб при кліку на маленьке зображення
// відкривалося модальне вікно з цим зображенням у великому розмірі та вищій якості.Звісно, цю логіку можна написати
// самостійно, але можна зекономити свій час і підключити цей функціонал із бібліотеки.

// Прикладом такої бібліотеки може бути “basicLightbox”.
// Насамперед тобі слід ознайомитися з документацією, яку можна знайти:

// на офіційному сайті цієї бібліотеки (https://basiclightbox.electerious.com/)
// Або
// в її репозиторії на github (https://github.com/electerious/basicLightbox)

// !Зверни увагу, що дизайн, структура та інтерфейс усіх бібліотек завжди буде різним, але обов’язково будуть:
// - інструкції зі встановлення та підключення до проєкту;
// - приклади використання;
// - особливості й можливі налаштування.

//! Встановлення та підключення бібліотеки
// У більшості офіційних документацій до бібліотек інструкції зі встановлення та підключення до проєкту найчастіше
// розташовані в розділах, які мають назви "Get Started", "Quick Start", "Installation", "Setup" або подібні.Це стало
// загальноприйнятою практикою, що дозволяє розробникам швидко знаходити необхідну інформацію.
// Наприклад, у basicLightbox цей розділ називається Setup.У ньому описано, як встановити basicLightbox за допомогою
// пакетних менеджерів(це ти будеш вивчати далі).

// Якщо тобі потрібно підключити бібліотеку через CDN, то знайшовши цю бібліотеку на сервісі CDN сервіс jsdelivr, ти
// отримаєш готові теги підключення скриптів і стилів, які потрібно просто додати у твій HTML.
// Але інколи вказується лише шлях до самого файлу, а готовий тег можна скопіювати, клікнувши на відповідну кнопку біля шляху.

//! Використання;
// Після підключення бібліотеки важливо зрозуміти, як її використовувати.Більшість документацій надає різноманітні приклади
// використання, які можна адаптувати для своїх потреб.Це часто зображено в розділах
// "Usage", "Examples", "API" або "Demo".
// В офіційній документації basicLightbox і на github у розділі API ти знайдеш різноманітні приклади використання, які
// допоможуть тобі зрозуміти, як працює бібліотека.Приклади часто демонструють, як використовувати основні функції та
// можливості бібліотеки.Але не обмежуйся лише прикладами з документації.Спробуй комбінувати різні функції, адаптуй їх під
// власні потреби та задачі твого проєкту.

// Наприклад, метод create() створить новий екземпляр basicLightbox. Очікує 2 параметри:
// контент модального вікна (обов’язковий параметр, із типом DOM-елемент або рядок {Node|String} )
// об’єкт налаштувань (не обов’язковий параметр, із типом об’єкт {?Object})

// Результатом виклику методу create() буде об’єкт екземпляра basicLightbox, який потрібно зберегти у змінну, наприклад,
// instance.

// const instance = basicLightbox.create(
//   `
// 	<h1>Not closable</h1>
// 	<p>It's not possible to close this lightbox with a click.</p>
// `,
//   {
//     closable: false,
//   }
// );

// Зверни увагу, що в екземпляра instance в документації є ще власний розділ Instance API, де описано доступні йому методи.
// Наприклад, виклик методу instance.show() покаже модальне вікно, а instance.close() — навпаки його сховає.

//! Особливості та додаткові налаштування
// Дуже важливим розділом у документації до будь - якої бібліотеки є розділ, який описує її особливості та додаткові
// налаштування.Цей розділ може мати різні назви в різних документаціях, але найчастіше він має назву "Options",
// "Advanced Settings", "Configuration Options", "Advanced Usage" або "Advanced Configuration" тощо.

// У бібліотеці basicLightbox в розділі Options міститься опис для об’єкта налаштувань, який можна передавати під час
// створення екземпляра в метод create().

// Наприклад, опція className дозволяє додавати додаткові класи до основного контейнера модального вікна.Це може бути
// корисно для стилізації модального вікна відповідно до твого дизайну, без потреби зміни основних стилів бібліотеки.

// Опція onShow призначена для виклику функції, коли модальне вікно відкривається.Це може бути корисно, якщо тобі
// потрібно виконати певні дії(наприклад, додати слухача) при відкритті модального вікна.

// Ознайомившись із документацією, тобі буде легше орієнтуватися в прикладах, які надає розробник цієї бібліотеки.

//! Деструктуризація
//! Навіщо потрібна деструктуризація?

// Деструктуризація(Destructuring) — це особливий синтаксис, що дозволяє витягти значення зі структур даних, такі як
// об'єкти або масиви, і присвоїти їх змінним. Це зручний спосіб дістати потрібні дані зі складних структур і використовувати
// їх у коді.
// Без деструктуризації робота з властивостями об'єкта має такий вигляд:

// const user = {
// 	name: "Jacob",
// 	age: 32
// };

// console.log(user.name); // Jacob
// console.log(user.age); // 32

// Із деструктуризацією робота з властивостями об'єкта має такий вигляд:

// const user = {
//   name: "Jacob",
//   age: 32,
// };

// const { name, age } = user;
// console.log(name); // Jacob
// console.log(age); // 32

//! Деструктуризація об'єктів
// Складні дані завжди представлені об'єктом. Багаторазові звернення до властивостей об'єкта візуально забруднюють код.

// const book = {
//   title: "The Last Kingdom",
//   author: "Bernard Cornwell",
//   genres: ["historical prose", "adventure"],
//   isPublic: true,
//   rating: 8.38,
// };

// const accessType = book.isPublic ? "pulbic" : "private";
// const message = `Book ${book.title} by author ${book.author} with rating ${book.rating} is in ${accessType} access!`;

// Деструктуризація дозволяє «розпакувати» значення властивостей об'єкта в локальні змінні. Це робить код у місці їх
// використання менш «шумним».

// const book = {
//   title: "The Last Kingdom",
//   author: "Bernard Cornwell",
//   genres: ["historical prose", "adventure"],
//   isPublic: true,
//   rating: 8.38,
// };

// // Деструктуризуємо
// const { title, author, isPublic, rating } = book;

// // Використовуємо
// const accessType = isPublic ? "pulbic" : "private";
// const message = `Book ${title} by author ${author} with rating ${rating} is in ${accessType} access!`;

// !Після ключового слова const або let ставимо фігурні дужки, як і у випадку з оголошенням об'єкта.
// !Усередині дужок, через кому, вказуємо імена змінних, яким будуть задані відповідні значення властивостей
// !деструктуризованого об’єкта.
// Деструктуризація завжди знаходиться в лівій частині операції присвоювання.
// Змінним усередині фігурних дужок присвоюються значення однойменних властивостей об'єкта з відповідними іменами.
// Послідовність оголошення змінних у фігурних дужках не важлива.

//! Деструктуризація неіснуючих властивостей
// У випадку, якщо ім'я змінної та ім'я властивості збігаються, то відбувається присвоєння.
// А що буде в іншому випадку?
// Коли в об'єкті немає властивості з таким ім'ям, змінній буде присвоєно undefined.

// const book = {
//   title: "The Last Kingdom",
//   author: "Bernard Cornwell",
//   genres: ["historical prose", "adventure"],
//   isPublic: true,
//   rating: 8.38,
// };

// // Деструктуризуємо
// const { title, bookTitle, coverImage, bookRating } = book;
// console.log(title); // "The Last Kingdom"
// console.log(bookTitle); // undefined
// console.log(coverImage); // undefined
// console.log(bookRating); // undefined

// З метою уникнення присвоєння undefined під час деструктуризації неіснуючих властивостей, можна задати змінним
// значення за замовчуванням, використовуючи знак =.Це значення буде присвоєно тільки у випадку, коли в об'єкті відсутня
// властивість із таким ім'ям.

// const book = {
//   title: "The Last Kingdom",
//   author: "Bernard Cornwell",
// };

// // Додамо зображення обкладинки, якщо вона відсутня в об'єкті книги
// const {
//   title,
//   author,
//   coverImage = "https://via.placeholder.com/640/480",
// } = book;

// console.log(title); // "The Last Kingdom"
// console.log(author); // "Bernard Cornwell"
// console.log(coverImage); // "https://via.placeholder.com/640/480"

//! Перейменування змінної
// Під час деструктуризації можна перейменувати змінну, в яку розпаковується значення властивості, використовуючи :.

// const book = {
//   title: "The Last Kingdom",
//   author: "Bernard Cornwell",
//   genres: ["historical prose", "adventure"],
//   isPublic: true,
//   rating: 8.38,
// };

// // Деструктуризуємо
// const { title, author: bookAuthor, isPublic, rating: bookRating } = book;
// console.log(title); // "The Last Kingdom"
// console.log(bookAuthor); // "Bernard Cornwell"
// console.log(isPublic); // true
// console.log(bookRating); // 8.38

// Для цього пишемо:
// ім'я властивості, з якої хочемо отримати значення
// ставимо двокрапку :
// пишемо ім'я змінної, в яку необхідно помістити значення цієї властивості.

//! Значення за замовчуванням
// При перейменуванні змінної, в яку ми розпаковуємо значення властивості об'єкта, також можна присвоїти значення за
// замовчуванням.
// Для цього після нового імені ставимо дорівнює = і вказуємо її значення за замовчуванням.

// const book = {
//   title: "The Last Kingdom",
//   coverImage:
//     "https://images-na.ssl-images-amazon.com/images/I/51b5YG6Y1rL.jpg",
// };

// const {
//   title,
//   coverImage: bookCoverImage = "https://via.placeholder.com/640/480",
// } = book;

// console.log(title); // "The Last Kingdom"
// console.log(bookCoverImage); // "https://images-na.ssl-images-amazon.com/images/I/51b5YG6Y1rL.jpg"

// Якщо така властивість існує в об'єкті, у змінну буде присвоєно її значення.
// В іншому випадку змінній буде присвоєно значення за замовчуванням.

// const book = {
//   title: "The Dream of a Ridiculous Man",
// };

// const {
//   title,
//   coverImage: bookCoverImage = "https://via.placeholder.com/640/480",
// } = book;

// console.log(title); // "The Dream of a Ridiculous Man"
// console.log(bookCoverImage); // "https://via.placeholder.com/640/480"

//! Деструктуризація в циклах
// Під час ітерації по масиву об'єктів циклом for...of відбуваються багаторазові звернення до властивостей об'єкта.

// const books = [
//   {
//     title: "The Last Kingdom",
//     author: "Bernard Cornwell",
//     rating: 8.38,
//   },
//   {
//     title: "Beside Still Waters",
//     author: "Robert Sheckley",
//     rating: 8.51,
//   },
// ];

// for (const book of books) {
//   console.log(book.title);
//   console.log(book.author);
//   console.log(book.rating);
// }

// Для того щоб скоротити кількість повторень, можна деструктуризувати властивості об'єкта в локальні змінні в тілі циклу.

// for (const book of books) {
//   const { title, author, rating } = book;

//   console.log(title);
//   console.log(author);
//   console.log(rating);
// }

// Якщо об'єкт містить небагато властивостей, деструктуризацію можна виконати безпосередньо в місці оголошення змінної book.

// for (const { title, author, rating } of books) {
//   console.log(title);
//   console.log(author);
//   console.log(rating);
// }

//! Деструктуризація параметрів
// Під час передачі об'єктів у функції, можна деструктуризувати об'єкти, щоб отримати доступ до потрібних даних.Це дає
// змогу явно вказати, які поля об'єкта використовуються у функції.
// Без деструктуризації об'єкта:

// function printUserInfo(user) {
//   console.log(`Name: ${user.name}, Age: ${user.age}, Hobby: ${user.hobby}`);
// }

// printUserInfo({
//   name: "Alice",
//   age: 25,
//   hobby: "dancing",
// }); // Name: Alice, Age: 25, Hobby: dancing

// З деструктуризацією об'єкта в тілі функції:

// function printUserInfo(user) {
//   const { name, age, hobby } = user;
//   console.log(`Name: ${name}, Age: ${age}, Hobby: ${hobby}`);
// }

// printUserInfo({
//   name: "Alice",
//   age: 25,
//   hobby: "dancing",
// }); // Name: Alice, Age: 25, Hobby: dancing

// Із деструктуризацією об'єкта в місці оголошення параметрів:

// function printUserInfo({ name, age, hobby }) {
//   console.log(`Name: ${name}, Age: ${age}, Hobby: ${hobby}`);
// }

// printUserInfo({
// 	name: "Alice",
// 	age: 25,
// 	hobby: "dancing"
// }); // Name: Alice, Age: 25, Hobby: dancing

//! Патерн «Об'єкт параметрів»
// Якщо функція приймає більше 2-3 параметрів, дуже просто заплутатися, в якій послідовності і що передавати.
// В результаті виходить дуже неочевидний код у місці її виклику.

// function doStuffWithBook(title, pages, downloads, rating, isPublic) {
//   // Робимо щось з параметрами
//   console.log(title);
//   console.log(numberOfPages);
//   // І так далі
// }

// // ❌ Що таке 736? Що таке 10283? Що таке true?
// doStuffWithBook("The Last Kingdom", 736, 10283, 8.38, true);

// Патерн «Об'єкт параметрів» допомагає вирішити цю проблему.
// Він заміняє набір параметрів всього одним — об'єктом з іменованими властивостями.

// function doStuffWithBook(book) {
//   // Робимо щось з властивостями об'єкта
//   console.log(book.title);
//   console.log(book.pages);
//   // І так далі
// }

// Таким чином, під час її виклику передаємо один об'єкт з необхідними властивостями.

// // ✅ Все зрозуміло
// doStuffWithBook({
//   title: "The Last Kingdom",
//   pages: 736,
//   downloads: 10283,
//   rating: 8.38,
//   isPublic: true,
// });

// Ще одна перевага в тому, що можна деструктуризувати об'єкт у параметрі book.
// Це можна зробити в тілі функції.

// function doStuffWithBook(book) {
//   const { title, pages, downloads, rating, isPublic } = book;
//   console.log(title);
//   console.log(pages);
// }

// Або в сигнатурі (підписі) функції — різниці немає.

// function doStuffWithBook({ title, pages, downloads, rating, isPublic }) {
//   console.log(title);
//   console.log(pages);
// }

//! Глибока деструктуризація
// Найчастіше дані будуть представлені об'єктами з більш ніж одним рівнем вкладеності.
// Так, наприклад, може виглядати об'єкт, що описує користувача соцмережі.

// const user = {
//   name: "Jacques Gluke",
//   tag: "jgluke",
//   stats: {
//     followers: 5603,
//     views: 4827,
//     likes: 1308,
//   },
// };

// Для деструктуризації властивостей вкладених об'єктів використовуються ті самі принципи. Для початку напишемо код
// деструктуризації властивостей об'єкта користувача.

// const user = {
//   name: "Jacques Gluke",
//   tag: "jgluke",
//   stats: {
//     followers: 5603,
//     views: 4827,
//     likes: 1308,
//   },
// };

// const { name, tag, stats } = user;

// console.log(name); // Jacques Gluke
// console.log(tag); // jgluke
// console.log(stats); // { followers: 5603, views: 4827, likes: 1308 }

// Тепер додамо глибоку деструктуризацію властивостей об'єкта stats.
// Для цього в деструктуризації після імені властивості ставимо двокрапку: та починаємо деструктуризацію об'єкта для цієї
// властивості.

// const user = {
//   name: "Jacques Gluke",
//   tag: "jgluke",
//   stats: {
//     followers: 5603,
//     views: 4827,
//     likes: 1308,
//   },
// };

// const {
//   name,
//   tag,
//   stats: { followers, views, likes },
// } = user;

// console.log(name); // Jacques Gluke
// console.log(tag); // jgluke
// console.log(followers); // 5603
// console.log(views); // 4827
// console.log(likes); // 1308

// Під час глибокої деструктуризації також можна змінювати імена змінних і присвоювати значення за замовчуванням,
// використовуючи вже знайомий тобі синтаксис.

// const user = {
//   name: "Jacques Gluke",
//   tag: "jgluke",
//   stats: {
//     followers: 5603,
//     views: 4827,
//     likes: 1308,
//   },
// };

// const {
//   name,
//   tag,
//   stats: { followers = 0, views: userViews = 0, likes: userLikes = 0 },
// } = user;

// console.log(name); // Jacques Gluke
// console.log(tag); // jgluke
// console.log(followers); // 5603
// console.log(userViews); // 4827
// console.log(userLikes); // 1308

//! Деструктуризація масивів
// Синтаксис;
// Деструктуризоване присвоювання можна використовувати не тільки для об’єктів, а й для масивів, але з деякими особливостями.
// Замість фігурних дужок {} використовуються квадратні [].
// Змінним, зазначеним у квадратних дужках [], будуть послідовно присвоюватися значення елементів масиву.
// Наприклад, є масив чисел. З нього потрібно отримати значення кожної складової кольору в окремих змінних.

// const color = [200, 255, 100];
// const [red, green, blue] = color;

// console.log(`rgb(${red}, ${green}, ${blue})`); // “rgb(200, 255, 100)"

// Після ключового слова const або let ставимо квадратні дужки, як і у випадку з оголошенням масиву.Всередині дужок, через
// кому, вказуємо імена змінних, у які будуть поміщені значення відповідних елементів масиву.
// Внаслідок такого запису будуть створені 3 змінні, і в них будуть поміщені елементи в нумерованому порядку: від 0 і до кінця
// масиву.

//! Значення за замовчуванням
// Якщо змінних оголошено більше, ніж елементів масиву, їм буде присвоєно undefined.Щоб запобігти цьому, можна вказувати
// значення за замовчуванням.
// Синтаксис такий самий, як в об'єктах, після імені змінної ставимо = і значення за замовчуванням.

// const color = [200, 100, 255];
// const [red, green, blue, alfa = 0.3] = color;

// console.log(`rgba(${red}, ${green}, ${blue}, ${alfa})`); // “rgba(200, 255, 100, 0.3)"

//! Часткова деструктуризація
// Іноді з масиву необхідно деструктуризувати тільки перші N елементів, а інші зберегти в одну змінну у вигляді масиву.
// Деструктуризуючи масив, можна розпакувати перші необхідні елементи і присвоїти іншу частину елементів масиву змінній,
// використовуючи операцію ...rest.

// const color = [200, 255, 100];

// const [ red, ...otherColors ] = color;

// console.log(red); // 200
// console.log(otherColors); // [255, 100]

// При цьому оригінальний масив не змінюється, у змінній otherColor буде новий масив із копіями зібраних значень.

// З об'єктами, до речі, це теж працює. Можна деструктуризувати певні властивості в окремі змінні, а решту зібрати в
// новий об'єкт.

// const user = {
//   name: "Jacob",
//   age: 32,
//   email: "j.cob@mail.com",
//   isOnline: true,
// };

// const { name, isOnline, ...otherProps } = user;

// console.log(name); // "Jacob"
// console.log(isOnline); // true
// console.log(otherProps); // {age: 32, email: "j.cob@mail.com"}

// При цьому оригінальний об'єкт не змінюється, у змінній otherProps буде новий об'єкт із копіями зібраних властивостей.

//! Пропуск значень
// На відміну від іменованих властивостей об'єкта, елементи масиву — це набір індексованих значень. Якщо необхідно
// деструктуризувати тільки, наприклад, третій елемент, перші два необхідно пропустити.
// Припустимо, з масиву color необхідно взяти тільки останнє значення.Для цього в деструктуризації необхідно відокремити
// комами елементи, що пропускаються.

// const rgb = [200, 100, 255];

// const [, , blue] = rgb;

// console.log(`Blue: ${blue}`); // "Blue: 255"

// На практиці в масивах ця можливість рідко використовується, але знати, що так можна робити, зайвим не буде.

//! Деструктуризація параметрів
// Під час передачі масиву у функцію, можна деструктуризувати його елементи.
// Без деструктуризації:

// function printFruits(fruits) {
//   console.log(fruits[0], fruits[1], fruits[2]);
// }

// printFruits(["apple", "banana", "orange"]); // "apple banana orange"

// Із деструктуризацією в місці оголошення параметрів:

// function printFruits([firstFruit, secondFruit, thirdFruit]) {
//   console.log(firstFruit, secondFruit, thirdFruit);
// }

// printFruits(["apple", "banana", "orange"]); // "apple banana orange"

// !Переваги деструктуризації
// Давай підсумуємо переваги деструктуризації:
// 1.Зручне вилучення значень з об'єктів і масивів: Замість того, щоб щоразу звертатися до полів об'єкта або елементів масиву
// за їхніми індексами або іменами, можна одразу витягти потрібні значення у змінні.
// 2.Короткий і читабельний код: Деструктуризація робить код коротшим і зрозумілішим.Замість довгих виразів доступу до полів
// об'єктів або елементів масиву, можна відразу присвоїти значення змінним зі зрозумілими іменами.
// 3.Параметри функцій: При передачі об'єктів у функції, можна деструктуризувати об'єкти, щоб отримати доступ до потрібних
// даних.Це дозволяє явно вказати, які поля об'єкта використовуються у функції.
// 4.Робота з функціями, що повертають об'єкти: Якщо функція повертає об'єкт, можна відразу деструктуризувати цей об'єкт,
// щоб витягти з нього значення.
